English/NewWords/TOEFL词根+联想.org
#+OPTIONS: ^:{} _:{} num:t toc:t \n:t
#+INCLUDE "../../template-toc.org"
#+SETUPFILE: "../../extension.org"
#+INFOJS_OPT: view:showall
#+title:TOEFL词根+联想
* List1
** accessory
   n 附件／配件
   adj 附属的／副的
   联想：
   adjunct 附属物／附属的
   additional 附加的／额外的
   additive 添加的／添加剂
** acoustic
   adj 听觉相关的／声学的
** acute
   severe/intense 极度的／激烈的
   acute sorrow/pain
   an acute shortage of oil
** adhere
   粘贴
   adhesive 带粘性的／胶合剂
   adhesion 粘连
** adobe
   泥砖
   adobe reader
** adolescence
   青春期
   adolescent
** adorn
   decorate 装饰
** aer-
   前缀表和空气相关的
   aerial 空中的
   aerobic 有氧运动／好氧的
   aerobic bacteria 好氧细菌
   aerobic sport 有氧运行
   aerobic fermentation 有氧发酵 
** aesthetic
   artistic 美学的
   审美的
** commodity
   商品
   commerce 商业
   commodities
** afflict
   tortue 折磨／使痛苦
* List2
** alga
   藻类／水藻
** alkali
   n 碱
   adj 碱性的
   acid 酸
** allay
   1. calm 使平静
   2. relieve, alleviate 减轻痛苦
   联想：
   1. alloy 合金
   2. alley 小路
   3. ally  伙伴／助手
** allegory
   寓言故事
   寓意／象征
** aluminum
   铝
   联想：
   magnesium 镁
** amino
   氨基的
   amino acid 氨基酸
** amnesia
   失忆症／健忘症
