English/NewWords/TOEFL词根+联想.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>TOEFL词根+联想</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="TOEFL词根+联想"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-11 22:59:56 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>


<div id="content">
<h1 class="title">TOEFL词根+联想</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/too_many_toc.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>


<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 List1</a>
<ul>
<li><a href="#sec-1-1">1.1 accessory</a></li>
<li><a href="#sec-1-2">1.2 acoustic</a></li>
<li><a href="#sec-1-3">1.3 acute</a></li>
<li><a href="#sec-1-4">1.4 adhere</a></li>
<li><a href="#sec-1-5">1.5 adobe</a></li>
<li><a href="#sec-1-6">1.6 adolescence</a></li>
<li><a href="#sec-1-7">1.7 adorn</a></li>
<li><a href="#sec-1-8">1.8 aer-</a></li>
<li><a href="#sec-1-9">1.9 aesthetic</a></li>
<li><a href="#sec-1-10">1.10 commodity</a></li>
<li><a href="#sec-1-11">1.11 afflict</a></li>
</ul>
</li>
<li><a href="#sec-2">2 List2</a>
<ul>
<li><a href="#sec-2-1">2.1 alga</a></li>
<li><a href="#sec-2-2">2.2 alkali</a></li>
<li><a href="#sec-2-3">2.3 allay</a></li>
<li><a href="#sec-2-4">2.4 allegory</a></li>
<li><a href="#sec-2-5">2.5 aluminum</a></li>
<li><a href="#sec-2-6">2.6 amino</a></li>
<li><a href="#sec-2-7">2.7 amnesia</a></li>
<li><a href="#sec-2-8">2.8 ample</a></li>
<li><a href="#sec-2-9">2.9 amplify</a></li>
<li><a href="#sec-2-10">2.10 anatomy</a></li>
<li><a href="#sec-2-11">2.11 anthropology</a></li>
<li><a href="#sec-2-12">2.12 antibiotic</a></li>
<li><a href="#sec-2-13">2.13 anticipate</a></li>
<li><a href="#sec-2-14">2.14 applicant</a></li>
<li><a href="#sec-2-15">2.15 apprentice</a></li>
<li><a href="#sec-2-16">2.16 appropriate</a></li>
<li><a href="#sec-2-17">2.17 aqua-</a></li>
<li><a href="#sec-2-18">2.18 archaeology</a></li>
<li><a href="#sec-2-19">2.19 arbitrary</a></li>
<li><a href="#sec-2-20">2.20 articulate</a></li>
<li><a href="#sec-2-21">2.21 artifact</a></li>
<li><a href="#sec-2-22">2.22 arid</a></li>
<li><a href="#sec-2-23">2.23 ascribe</a></li>
</ul>
</li>
<li><a href="#sec-3">3 List3</a>
<ul>
<li><a href="#sec-3-1">3.1 premise</a></li>
<li><a href="#sec-3-2">3.2 asteroid</a></li>
<li><a href="#sec-3-3">3.3 attain</a></li>
<li><a href="#sec-3-4">3.4 auction</a></li>
<li><a href="#sec-3-5">3.5 auditorium</a></li>
<li><a href="#sec-3-6">3.6 augment</a></li>
<li><a href="#sec-3-7">3.7 avalanche</a></li>
<li><a href="#sec-3-8">3.8 avert</a></li>
<li><a href="#sec-3-9">3.9 aviation</a></li>
<li><a href="#sec-3-10">3.10 bald</a></li>
<li><a href="#sec-3-11">3.11 barge</a></li>
<li><a href="#sec-3-12">3.12 barren</a></li>
<li><a href="#sec-3-13">3.13 barter</a></li>
<li><a href="#sec-3-14">3.14 bead</a></li>
<li><a href="#sec-3-15">3.15 benign</a></li>
<li><a href="#sec-3-16">3.16 besiege</a></li>
<li><a href="#sec-3-17">3.17 bias</a></li>
<li><a href="#sec-3-18">3.18 bland</a></li>
<li><a href="#sec-3-19">3.19 bleach</a></li>
<li><a href="#sec-3-20">3.20 blend</a></li>
<li><a href="#sec-3-21">3.21 blip</a></li>
</ul>
</li>
<li><a href="#sec-4">4 List4</a>
<ul>
<li><a href="#sec-4-1">4.1 blizzard</a></li>
<li><a href="#sec-4-2">4.2 blossom</a></li>
<li><a href="#sec-4-3">4.3 bog</a></li>
<li><a href="#sec-4-4">4.4 bony</a></li>
<li><a href="#sec-4-5">4.5 boulder</a></li>
<li><a href="#sec-4-6">4.6 brittle</a></li>
<li><a href="#sec-4-7">4.7 brochure</a></li>
<li><a href="#sec-4-8">4.8 buckle</a></li>
<li><a href="#sec-4-9">4.9 bulk</a></li>
<li><a href="#sec-4-10">4.10 bureau</a></li>
<li><a href="#sec-4-11">4.11 burgeon</a></li>
<li><a href="#sec-4-12">4.12 cactus</a></li>
<li><a href="#sec-4-13">4.13 calibration</a></li>
<li><a href="#sec-4-14">4.14 camouflage</a></li>
<li><a href="#sec-4-15">4.15 canvas</a></li>
<li><a href="#sec-4-16">4.16 canopy</a></li>
<li><a href="#sec-4-17">4.17 canyon</a></li>
<li><a href="#sec-4-18">4.18 capillary</a></li>
<li><a href="#sec-4-19">4.19 cardiac</a></li>
<li><a href="#sec-4-20">4.20 cardinal</a></li>
<li><a href="#sec-4-21">4.21 carnivore</a></li>
<li><a href="#sec-4-22">4.22 carp</a></li>
</ul>
</li>
<li><a href="#sec-5">5 List5</a>
<ul>
<li><a href="#sec-5-1">5.1 cascara</a></li>
<li><a href="#sec-5-2">5.2 catalyst</a></li>
<li><a href="#sec-5-3">5.3 caterpillar</a></li>
<li><a href="#sec-5-4">5.4 cavity</a></li>
<li><a href="#sec-5-5">5.5 celestial</a></li>
<li><a href="#sec-5-6">5.6 census</a></li>
<li><a href="#sec-5-7">5.7 centennial</a></li>
<li><a href="#sec-5-8">5.8 ceramic</a></li>
<li><a href="#sec-5-9">5.9 chafe</a></li>
<li><a href="#sec-5-10">5.10 chamber</a></li>
<li><a href="#sec-5-11">5.11 chapel</a></li>
<li><a href="#sec-5-12">5.12 charter</a></li>
<li><a href="#sec-5-13">5.13 charcoal</a></li>
<li><a href="#sec-5-14">5.14 checked</a></li>
<li><a href="#sec-5-15">5.15 baboon</a></li>
<li><a href="#sec-5-16">5.16 chlorine</a></li>
<li><a href="#sec-5-17">5.17 cholesterol</a></li>
<li><a href="#sec-5-18">5.18 choreograph</a></li>
<li><a href="#sec-5-19">5.19 choir</a></li>
<li><a href="#sec-5-20">5.20 chronic</a></li>
<li><a href="#sec-5-21">5.21 circumference</a></li>
<li><a href="#sec-5-22">5.22 clam</a></li>
<li><a href="#sec-5-23">5.23 clamor</a></li>
<li><a href="#sec-5-24">5.24 clipper</a></li>
<li><a href="#sec-5-25">5.25 cluster</a></li>
<li><a href="#sec-5-26">5.26 clump</a></li>
<li><a href="#sec-5-27">5.27 clutch</a></li>
<li><a href="#sec-5-28">5.28 coarse</a></li>
<li><a href="#sec-5-29">5.29 coax</a></li>
<li><a href="#sec-5-30">5.30 cognition</a></li>
<li><a href="#sec-5-31">5.31 coil</a></li>
<li><a href="#sec-5-32">5.32 ellipsis</a></li>
<li><a href="#sec-5-33">5.33 apostrophe</a></li>
<li><a href="#sec-5-34">5.34 despicable</a></li>
<li><a href="#sec-5-35">5.35 myriad</a></li>
<li><a href="#sec-5-36">5.36 mnemonic</a></li>
</ul>
</li>
<li><a href="#sec-6">6 List6</a>
<ul>
<li><a href="#sec-6-1">6.1 collapse</a></li>
<li><a href="#sec-6-2">6.2 combustible</a></li>
<li><a href="#sec-6-3">6.3 commemorate</a></li>
<li><a href="#sec-6-4">6.4 commodity</a></li>
<li><a href="#sec-6-5">6.5 communal</a></li>
<li><a href="#sec-6-6">6.6 advertent</a></li>
<li><a href="#sec-6-7">6.7 compensate</a></li>
<li><a href="#sec-6-8">6.8 competence</a></li>
<li><a href="#sec-6-9">6.9 comprise</a></li>
<li><a href="#sec-6-10">6.10 concede</a></li>
<li><a href="#sec-6-11">6.11 conceive</a></li>
<li><a href="#sec-6-12">6.12 concert</a></li>
<li><a href="#sec-6-13">6.13 condensation</a></li>
<li><a href="#sec-6-14">6.14 confederacy</a></li>
<li><a href="#sec-6-15">6.15 confer</a></li>
</ul>
</li>
<li><a href="#sec-7">7 List7</a>
<ul>
<li><a href="#sec-7-1">7.1 conform</a></li>
<li><a href="#sec-7-2">7.2 malady</a></li>
<li><a href="#sec-7-3">7.3 congenial</a></li>
<li><a href="#sec-7-4">7.4 kindred</a></li>
<li><a href="#sec-7-5">7.5 consent</a></li>
<li><a href="#sec-7-6">7.6 constellation</a></li>
<li><a href="#sec-7-7">7.7 consort</a></li>
<li><a href="#sec-7-8">7.8 consonant</a></li>
<li><a href="#sec-7-9">7.9 volatile</a></li>
<li><a href="#sec-7-10">7.10 electorate</a></li>
<li><a href="#sec-7-11">7.11 contagious</a></li>
<li><a href="#sec-7-12">7.12 contaminate</a></li>
<li><a href="#sec-7-13">7.13 contour</a></li>
<li><a href="#sec-7-14">7.14 controversy</a></li>
<li><a href="#sec-7-15">7.15 convect</a></li>
<li><a href="#sec-7-16">7.16 converge</a></li>
<li><a href="#sec-7-17">7.17 intervene</a></li>
<li><a href="#sec-7-18">7.18 convict</a></li>
<li><a href="#sec-7-19">7.19 cosmic</a></li>
<li><a href="#sec-7-20">7.20 correspond</a></li>
<li><a href="#sec-7-21">7.21 counteract</a></li>
<li><a href="#sec-7-22">7.22 counterpart</a></li>
<li><a href="#sec-7-23">7.23 coupon</a></li>
</ul>
</li>
<li><a href="#sec-8">8 List8</a>
<ul>
<li><a href="#sec-8-1">8.1 craft</a></li>
<li><a href="#sec-8-2">8.2 crater</a></li>
<li><a href="#sec-8-3">8.3 credential</a></li>
<li><a href="#sec-8-4">8.4 crest</a></li>
<li><a href="#sec-8-5">8.5 crisscross</a></li>
<li><a href="#sec-8-6">8.6 critique</a></li>
<li><a href="#sec-8-7">8.7 cramped</a></li>
<li><a href="#sec-8-8">8.8 crude</a></li>
<li><a href="#sec-8-9">8.9 crusade</a></li>
<li><a href="#sec-8-10">8.10 crust</a></li>
<li><a href="#sec-8-11">8.11 crustacean</a></li>
<li><a href="#sec-8-12">8.12 cue</a></li>
<li><a href="#sec-8-13">8.13 cumbersome</a></li>
<li><a href="#sec-8-14">8.14 cultivated</a></li>
<li><a href="#sec-8-15">8.15 metabolic</a></li>
<li><a href="#sec-8-16">8.16 damp</a></li>
<li><a href="#sec-8-17">8.17 diminish</a></li>
<li><a href="#sec-8-18">8.18 demolish</a></li>
<li><a href="#sec-8-19">8.19 devour</a></li>
<li><a href="#sec-8-20">8.20 dazzling</a></li>
<li><a href="#sec-8-21">8.21 deteriorate</a></li>
<li><a href="#sec-8-22">8.22 defect</a></li>
<li><a href="#sec-8-23">8.23 delicate</a></li>
<li><a href="#sec-8-24">8.24 deform</a></li>
<li><a href="#sec-8-25">8.25 deliberate</a></li>
<li><a href="#sec-8-26">8.26 denture</a></li>
</ul>
</li>
<li><a href="#sec-9">9 List9</a>
<ul>
<li><a href="#sec-9-1">9.1 deplete</a></li>
<li><a href="#sec-9-2">9.2 deprive</a></li>
<li><a href="#sec-9-3">9.3 portray</a></li>
<li><a href="#sec-9-4">9.4 designate</a></li>
<li><a href="#sec-9-5">9.5 deter</a></li>
<li><a href="#sec-9-6">9.6 detest</a></li>
<li><a href="#sec-9-7">9.7 devise</a></li>
<li><a href="#sec-9-8">9.8 devoid</a></li>
<li><a href="#sec-9-9">9.9 diagonal</a></li>
<li><a href="#sec-9-10">9.10 diffuse</a></li>
<li><a href="#sec-9-11">9.11 dilute</a></li>
<li><a href="#sec-9-12">9.12 dim</a></li>
<li><a href="#sec-9-13">9.13 discern</a></li>
<li><a href="#sec-9-14">9.14 discharge</a></li>
<li><a href="#sec-9-15">9.15 dilemma</a></li>
<li><a href="#sec-9-16">9.16 deposit</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> List1</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> accessory</h3>
<div class="outline-text-3" id="text-1-1">

<p>   n 附件／配件<br/>
   adj 附属的／副的<br/>
   联想：<br/>
   adjunct 附属物／附属的<br/>
   additional 附加的／额外的<br/>
   additive 添加的／添加剂<br/>
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> acoustic</h3>
<div class="outline-text-3" id="text-1-2">

<p>   adj 听觉相关的／声学的<br/>
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> acute</h3>
<div class="outline-text-3" id="text-1-3">

<p>   severe/intense 极度的／激烈的<br/>
   acute sorrow/pain<br/>
   an acute shortage of oil<br/>
</p></div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> adhere</h3>
<div class="outline-text-3" id="text-1-4">

<p>   粘贴<br/>
   adhesive 带粘性的／胶合剂<br/>
   adhesion 粘连<br/>
</p></div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> adobe</h3>
<div class="outline-text-3" id="text-1-5">

<p>   泥砖<br/>
   adobe reader<br/>
</p></div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> adolescence</h3>
<div class="outline-text-3" id="text-1-6">

<p>   青春期<br/>
   adolescent<br/>
</p></div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> adorn</h3>
<div class="outline-text-3" id="text-1-7">

<p>   decorate 装饰<br/>
</p></div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> aer-</h3>
<div class="outline-text-3" id="text-1-8">

<p>   前缀表和空气相关的<br/>
   aerial 空中的<br/>
   aerobic 有氧运动／好氧的<br/>
   aerobic bacteria 好氧细菌<br/>
   aerobic sport 有氧运行<br/>
   aerobic fermentation 有氧发酵 <br/>
</p></div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> aesthetic</h3>
<div class="outline-text-3" id="text-1-9">

<p>   artistic 美学的<br/>
   审美的<br/>
</p></div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> commodity</h3>
<div class="outline-text-3" id="text-1-10">

<p>   商品<br/>
   commerce 商业<br/>
   commodities<br/>
</p></div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> afflict</h3>
<div class="outline-text-3" id="text-1-11">

<p>   tortue 折磨／使痛苦<br/>
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> List2</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> alga</h3>
<div class="outline-text-3" id="text-2-1">

<p>   藻类／水藻<br/>
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> alkali</h3>
<div class="outline-text-3" id="text-2-2">

<p>   n 碱<br/>
   adj 碱性的<br/>
   acid 酸<br/>
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> allay</h3>
<div class="outline-text-3" id="text-2-3">

<ol>
<li>calm 使平静<br/>
</li>
<li>relieve, alleviate 减轻痛苦<br/>
</li>
</ol>

<p>   联想：<br/>
</p><ol>
<li>alloy 合金<br/>
</li>
<li>alley 小路<br/>
</li>
<li>ally  伙伴／助手<br/>
</li>
</ol>

</div>

</div>
