English/NewWords/TOEFL词根+联想.org
** ample
   充足的／丰富的
   plentiful/sufficient/abundant/abound/adequate
** amplify
   加强 make larger/stronger/greater or enlarge or extend
   提高音量
   amplifier 扩音器／放大器
   amplification  放大
** anatomy
   解剖学
** anthropology
   人类学
   anthropologist 人类学家
   anthropological 人类学的
** antibiotic
   抗生素
   biotic 生物相关的
** anticipate
   预期／预见 foresee/look forward to
   anticipated 预期的
** applicant
   申请者
   apply for 申请
   application 应用程序／应用／申请
** apprentice
   学徒
** appropriate
   v 拨款／占用
   adj 合适的
** aqua-
   做为前缀表与水有关的
   aquatic 水生动植物／水生的／水上的 marine
   aquarium 养鱼池／水族馆
   联想：
   natatorium 游泳馆
** archaeology
   考古学
   archaeologist 考古学家
   archaeological 考古学的
   archaeological site 考古遗址
** arbitrary
   任意的／专制的，武断的
** articulate
   adj 表达清晰的／关节相关的
   v 清晰地表达 
#+begin_example
Be careful to articulate your words so that everyone in the room can understand you.
#+end_example
   articulation 关节
   articulation point 关节点／连接点
** artifact
   人工制品
   artifactitious 人工现象的／人工制品的
   artificial 人造的／合成的
   artificiality 人工／不自然
   synthetic 合成的 -> n synthesis 综合
** arid
   droughty 干旱的
   arid climate 干旱气候
   n drought 干旱
** ascribe
   ascribe sth to sb/sth 归因于
* List3
** premise
   n 前提假设
   v 作出前提
   assume/suppose
   on the premise
** asteroid
   小行星
   minor planet
** attain
   reach/accomplish/obtain/achieve/gain 获得，达到
** auction
   public sale 拍卖
** auditorium
   礼堂
   orium/arium后缀结尾的一般表“地方”
   natatorium 游泳馆
   aquarium 水族馆
** augment
   增加／增强
   augmentation
   augmented
   augmenting
   编译原理LR语法分析时 augmented grammer 增广文法
** avalanche
   n 雪崩/山崩 snowslide/landslide
** avert
   avoid 避开／避免
   n aversion
   avert the eyes from sth
   avert dangers
** aviation
   飞行学／航空行
   aviator 飞行家／飞行员
** bald
   光秃
   联想：
   bold 大胆的
** barge
   驳船／游艇
** barren
   infertile/unproductive 贫瘠的
   sterile 不育的
** barter
   trade／deal 实物交换
** bead
   n 珠子／水珠
   v 形成珠状
** benign
   gentle/mild 温和的／气候良好的／性情温和的
** besiege
   surround so as to force to give up 围攻
   被困扰／使烦恼
** bias
   n inclination 偏见
   v 存在偏见
** bland
   nonirritating 无刺激的／平淡的／无味的
** bleach
   v 漂白／使变白 to make whiter or lighter in color
** blend
   mix 混合
   blend the ingredients
** blip
   雷达上的尖峰
* List4
** blizzard
   a storm with dry, driving snow, strong wind and intense cold. 暴风雪
   联想：bazaar
   <<The Cathedral And The Bazaar>> 大教堂和集市
** blossom
   v 开花/兴旺
   n 花/开花期
   同义词：bloom 
** bog
   n 沼泽
   v 陷于沼泽
** bony
   very thin 瘦骨嶙峋的
** boulder
   a large smooth mass of rock 大石头
** brittle
   fragile 易碎的
   loacking warmth and generosity of spirit 冷漠的
** brochure
   pamphlet, booklet 小册子
** buckle
   n 皮带扣
   v 扣住
** bulk
   n majority 大部分/体积/容量
   v 增大体积/使显得重要
** bureau
   局/署, 官僚
   bureaucrat 官僚主义者
   bureaucratic 官僚主义的
   bureaucracy 官僚主义
