English/NewWords/TOEFL词根+联想.html

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> allegory</h3>
<div class="outline-text-3" id="text-2-4">

<p>   寓言故事<br/>
   寓意／象征<br/>
</p></div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> aluminum</h3>
<div class="outline-text-3" id="text-2-5">

<p>   铝<br/>
   联想：<br/>
   magnesium 镁<br/>
</p></div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> amino</h3>
<div class="outline-text-3" id="text-2-6">

<p>   氨基的<br/>
   amino acid 氨基酸<br/>
</p></div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> amnesia</h3>
<div class="outline-text-3" id="text-2-7">

<p>   失忆症／健忘症<br/>
</p></div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> ample</h3>
<div class="outline-text-3" id="text-2-8">

<p>   充足的／丰富的<br/>
   plentiful/sufficient/abundant/abound/adequate<br/>
</p></div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> amplify</h3>
<div class="outline-text-3" id="text-2-9">

<p>   加强 make larger/stronger/greater or enlarge or extend<br/>
   提高音量<br/>
   amplifier 扩音器／放大器<br/>
   amplification  放大<br/>
</p></div>

</div>

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> anatomy</h3>
<div class="outline-text-3" id="text-2-10">

<p>   解剖学<br/>
</p></div>

</div>

<div id="outline-container-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> anthropology</h3>
<div class="outline-text-3" id="text-2-11">

<p>   人类学<br/>
   anthropologist 人类学家<br/>
   anthropological 人类学的<br/>
</p></div>

</div>

<div id="outline-container-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> antibiotic</h3>
<div class="outline-text-3" id="text-2-12">

<p>   抗生素<br/>
   biotic 生物相关的<br/>
</p></div>

</div>

<div id="outline-container-2-13" class="outline-3">
<h3 id="sec-2-13"><span class="section-number-3">2.13</span> anticipate</h3>
<div class="outline-text-3" id="text-2-13">

<p>   预期／预见 foresee/look forward to<br/>
   anticipated 预期的<br/>
</p></div>

</div>

<div id="outline-container-2-14" class="outline-3">
<h3 id="sec-2-14"><span class="section-number-3">2.14</span> applicant</h3>
<div class="outline-text-3" id="text-2-14">

<p>   申请者<br/>
   apply for 申请<br/>
   application 应用程序／应用／申请<br/>
</p></div>

</div>

<div id="outline-container-2-15" class="outline-3">
<h3 id="sec-2-15"><span class="section-number-3">2.15</span> apprentice</h3>
<div class="outline-text-3" id="text-2-15">

<p>   学徒<br/>
</p></div>

</div>

<div id="outline-container-2-16" class="outline-3">
<h3 id="sec-2-16"><span class="section-number-3">2.16</span> appropriate</h3>
<div class="outline-text-3" id="text-2-16">

<p>   v 拨款／占用<br/>
   adj 合适的<br/>
</p></div>

</div>

<div id="outline-container-2-17" class="outline-3">
<h3 id="sec-2-17"><span class="section-number-3">2.17</span> aqua-</h3>
<div class="outline-text-3" id="text-2-17">

<p>   做为前缀表与水有关的<br/>
   aquatic 水生动植物／水生的／水上的 marine<br/>
   aquarium 养鱼池／水族馆<br/>
   联想：<br/>
   natatorium 游泳馆<br/>
</p></div>

</div>

<div id="outline-container-2-18" class="outline-3">
<h3 id="sec-2-18"><span class="section-number-3">2.18</span> archaeology</h3>
<div class="outline-text-3" id="text-2-18">

<p>   考古学<br/>
   archaeologist 考古学家<br/>
   archaeological 考古学的<br/>
   archaeological site 考古遗址<br/>
</p></div>

</div>

<div id="outline-container-2-19" class="outline-3">
<h3 id="sec-2-19"><span class="section-number-3">2.19</span> arbitrary</h3>
<div class="outline-text-3" id="text-2-19">

<p>   任意的／专制的，武断的<br/>
</p></div>

</div>

<div id="outline-container-2-20" class="outline-3">
<h3 id="sec-2-20"><span class="section-number-3">2.20</span> articulate</h3>
<div class="outline-text-3" id="text-2-20">

<p>   adj 表达清晰的／关节相关的<br/>
   v 清晰地表达 <br/>
</p>


<pre class="example">Be careful to articulate your words so that everyone in the room can understand you.
</pre>

<p>
   articulation 关节<br/>
   articulation point 关节点／连接点<br/>
</p></div>

</div>

<div id="outline-container-2-21" class="outline-3">
<h3 id="sec-2-21"><span class="section-number-3">2.21</span> artifact</h3>
<div class="outline-text-3" id="text-2-21">

<p>   人工制品<br/>
   artifactitious 人工现象的／人工制品的<br/>
   artificial 人造的／合成的<br/>
   artificiality 人工／不自然<br/>
   synthetic 合成的 -&gt; n synthesis 综合<br/>
</p></div>

</div>

<div id="outline-container-2-22" class="outline-3">
<h3 id="sec-2-22"><span class="section-number-3">2.22</span> arid</h3>
<div class="outline-text-3" id="text-2-22">

<p>   droughty 干旱的<br/>
   arid climate 干旱气候<br/>
   n drought 干旱<br/>
</p></div>

</div>

<div id="outline-container-2-23" class="outline-3">
<h3 id="sec-2-23"><span class="section-number-3">2.23</span> ascribe</h3>
<div class="outline-text-3" id="text-2-23">

<p>   ascribe sth to sb/sth 归因于<br/>
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> List3</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> premise</h3>
<div class="outline-text-3" id="text-3-1">

<p>   n 前提假设<br/>
   v 作出前提<br/>
   assume/suppose<br/>
   on the premise<br/>
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> asteroid</h3>
<div class="outline-text-3" id="text-3-2">

<p>   小行星<br/>
   minor planet<br/>
</p></div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> attain</h3>
<div class="outline-text-3" id="text-3-3">

<p>   reach/accomplish/obtain/achieve/gain 获得，达到<br/>
</p></div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> auction</h3>
<div class="outline-text-3" id="text-3-4">

<p>   public sale 拍卖<br/>
</p></div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> auditorium</h3>
<div class="outline-text-3" id="text-3-5">

<p>   礼堂<br/>
   orium/arium后缀结尾的一般表“地方”<br/>
   natatorium 游泳馆<br/>
   aquarium 水族馆<br/>
</p></div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> augment</h3>
<div class="outline-text-3" id="text-3-6">

<p>   增加／增强<br/>
   augmentation<br/>
   augmented<br/>
   augmenting<br/>
   编译原理LR语法分析时 augmented grammer 增广文法<br/>
</p></div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> avalanche</h3>
<div class="outline-text-3" id="text-3-7">

<p>   n 雪崩/山崩 snowslide/landslide<br/>
</p></div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> avert</h3>
<div class="outline-text-3" id="text-3-8">

<p>   avoid 避开／避免<br/>
   n aversion<br/>
   avert the eyes from sth<br/>
   avert dangers<br/>
</p></div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> aviation</h3>
<div class="outline-text-3" id="text-3-9">

<p>   飞行学／航空行<br/>
   aviator 飞行家／飞行员<br/>
</p></div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> bald</h3>
<div class="outline-text-3" id="text-3-10">

<p>   光秃<br/>
   联想：<br/>
   bold 大胆的<br/>
</p></div>

</div>

<div id="outline-container-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> barge</h3>
<div class="outline-text-3" id="text-3-11">

<p>   驳船／游艇<br/>
</p></div>

</div>

<div id="outline-container-3-12" class="outline-3">
<h3 id="sec-3-12"><span class="section-number-3">3.12</span> barren</h3>
<div class="outline-text-3" id="text-3-12">

<p>   infertile/unproductive 贫瘠的<br/>
   sterile 不育的<br/>
</p></div>

</div>

<div id="outline-container-3-13" class="outline-3">
<h3 id="sec-3-13"><span class="section-number-3">3.13</span> barter</h3>
<div class="outline-text-3" id="text-3-13">

<p>   trade／deal 实物交换<br/>
</p></div>

</div>

<div id="outline-container-3-14" class="outline-3">
<h3 id="sec-3-14"><span class="section-number-3">3.14</span> bead</h3>
<div class="outline-text-3" id="text-3-14">

<p>   n 珠子／水珠<br/>
   v 形成珠状<br/>
</p></div>

</div>

<div id="outline-container-3-15" class="outline-3">
<h3 id="sec-3-15"><span class="section-number-3">3.15</span> benign</h3>
<div class="outline-text-3" id="text-3-15">

<p>   gentle/mild 温和的／气候良好的／性情温和的<br/>
</p></div>

</div>

<div id="outline-container-3-16" class="outline-3">
<h3 id="sec-3-16"><span class="section-number-3">3.16</span> besiege</h3>
<div class="outline-text-3" id="text-3-16">

<p>   surround so as to force to give up 围攻<br/>
   被困扰／使烦恼<br/>
</p></div>

</div>

<div id="outline-container-3-17" class="outline-3">
<h3 id="sec-3-17"><span class="section-number-3">3.17</span> bias</h3>
<div class="outline-text-3" id="text-3-17">

<p>   n inclination 偏见<br/>
   v 存在偏见<br/>
</p></div>

</div>

<div id="outline-container-3-18" class="outline-3">
<h3 id="sec-3-18"><span class="section-number-3">3.18</span> bland</h3>
<div class="outline-text-3" id="text-3-18">

<p>   nonirritating 无刺激的／平淡的／无味的<br/>
</p></div>

</div>

<div id="outline-container-3-19" class="outline-3">
<h3 id="sec-3-19"><span class="section-number-3">3.19</span> bleach</h3>
<div class="outline-text-3" id="text-3-19">

<p>   v 漂白／使变白 to make whiter or lighter in color<br/>
</p></div>

</div>

<div id="outline-container-3-20" class="outline-3">
<h3 id="sec-3-20"><span class="section-number-3">3.20</span> blend</h3>
<div class="outline-text-3" id="text-3-20">

<p>   mix 混合<br/>
   blend the ingredients<br/>
</p></div>

</div>

<div id="outline-container-3-21" class="outline-3">
<h3 id="sec-3-21"><span class="section-number-3">3.21</span> blip</h3>
<div class="outline-text-3" id="text-3-21">

<p>   雷达上的尖峰<br/>
</p></div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> List4</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> blizzard</h3>
<div class="outline-text-3" id="text-4-1">

<p>   a storm with dry, driving snow, strong wind and intense cold. 暴风雪<br/>
   联想：bazaar<br/>
   <a name="The-Cathedral-And-The-Bazaar" class="target">The Cathedral And The Bazaar</a> 大教堂和集市<br/>
</p></div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> blossom</h3>
<div class="outline-text-3" id="text-4-2">

<p>   v 开花/兴旺<br/>
   n 花/开花期<br/>
   同义词：bloom <br/>
</p></div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> bog</h3>
<div class="outline-text-3" id="text-4-3">

<p>   n 沼泽<br/>
   v 陷于沼泽<br/>
</p></div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> bony</h3>
<div class="outline-text-3" id="text-4-4">

<p>   very thin 瘦骨嶙峋的<br/>
</p></div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> boulder</h3>
<div class="outline-text-3" id="text-4-5">

<p>   a large smooth mass of rock 大石头<br/>
</p></div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> brittle</h3>
<div class="outline-text-3" id="text-4-6">

<p>   fragile 易碎的<br/>
   loacking warmth and generosity of spirit 冷漠的<br/>
</p></div>

</div>

<div id="outline-container-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> brochure</h3>
<div class="outline-text-3" id="text-4-7">

<p>   pamphlet, booklet 小册子<br/>
</p></div>

</div>

<div id="outline-container-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> buckle</h3>
<div class="outline-text-3" id="text-4-8">

<p>   n 皮带扣<br/>
   v 扣住<br/>
</p></div>

</div>

<div id="outline-container-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> bulk</h3>
<div class="outline-text-3" id="text-4-9">

<p>   n majority 大部分/体积/容量<br/>
   v 增大体积/使显得重要<br/>
</p></div>

</div>

<div id="outline-container-4-10" class="outline-3">
<h3 id="sec-4-10"><span class="section-number-3">4.10</span> bureau</h3>
<div class="outline-text-3" id="text-4-10">

<p>   局/署, 官僚<br/>
   bureaucrat 官僚主义者<br/>
   bureaucratic 官僚主义的<br/>
   bureaucracy 官僚主义<br/>
</p></div>

</div>
