English/NewWords/TOEFL词根+联想.org
** burgeon
   bloom flourish 迅速增长
   发芽
** cactus
   仙人掌
** calibration
   calibrate 测量口径/调整
   calibration 标度/刻度
** camouflage
   disguise hide 掩饰/伪装
** canvas
   帆布/画布
** canopy
   遮篷
** canyon
   峡谷
** capillary
   毛细血管
   vessel 血管
** cardiac
   心脏的/心脏病的
   cardiac rhythm 心律
   cardiac failure 心力衰竭
** cardinal
   adj main essential 主要的/基本的
       vivid red 深红色的
   n 红衣主教
   cardinal number 基数
** carnivore
   食肉动物
   同义词：predator 捕食者/食肉动物
** carp
   鲤鱼
* List5
** cascara
   缓泻剂（治疗便秘）
** catalyst
   [化学]催化剂
   刺激因素
** caterpillar
   毛虫（蝴蝶的幼虫）
** cavity
   cave 洞
   [解剖anatomy]腔
** celestial
   adj 天空的
   n 神仙
** census
   人口普查
** centennial
   百年纪念
   centenary 百年的
   millennium 千年的/千禧年
** ceramic
   陶瓷的
   ceram 陶瓷
** chafe
   abrade rub 擦伤/摩擦
   激怒 irritate
** chamber
   n 房间/私人会所
   adj 私人的/室内的
** chapel
   小教堂
   cathedral 大教堂
   bazaar 集市
** charter
   n 宪章/执照
   v 特许
** charcoal
   木炭
** checked
   格子花纹的
** baboon
   狒狒
   chimpanzee 黑猩猩
   gorilla 大猩猩
   orangutan 猩猩
** chlorine
   [化学]氯
   aluminum 铝
   magnesium 镁
** cholesterol
   胆固醇
   chole 胆/胆汁
   sterol 固醇
** choreograph
   编排舞蹈
   choreographer 编舞者
   choreography 编舞/舞蹈艺术
** choir
   唱诗班
   chorus 合唱队
** chronic
   慢性的
   chronical 慢性的
   chron-时间相关的
   chronicle 编年史
   chrono-时间长的
   chronology 年代学
** circumference
   周长/圆周
   periphery 周边 peripheral equipment 外围设备
   perimeter 圆周
** clam
   蛤
   oyster 牡蛎
   abalone 鲍鱼
   coral 珊瑚
   crab 螃蟹
** clamor
   n/v 吵闹/喧嚷
   proclaim 声明/宣告
   proclamation
   reclaim 回收利用/开拓
   reclamation
   exclaim 感叹
   exclamation 感叹 exclamation mark感叹号 exclamatory 感叹的
   变名词时去掉i
** clipper
   快速帆船/大剪刀/理发剪刀
   clip n/v修剪
** cluster
   簇
** clump
   n 土块/丛
   v 形成丛
** clutch
   n 离合器
   v 抓住
** coarse
   粗糙的/粗俗的/下流的
   hoarse 嘶哑的
** coax
   哄/哄骗/慢慢弄好，细心处理
   Coax
   coaxial/coxal 同轴的（having a common axis）
** cognition
   认知/感知 perception
   cognitive 认知的
** coil
   n 卷/线圈
   v 盘绕
** ellipsis
   省略(号)
   ellipse 椭圆
** apostrophe
   省略号/撇号
** despicable
   卑鄙的
** myriad
   大量的
   一万
** mnemonic
   记忆的/助记的
   
* List6
** collapse
   倒塌/折叠（bootstrap中有一个控件叫collapse）
** combustible
   flammable 易燃的
   combust v燃烧
   combustion n
** commemorate
   v 纪念 honor/celebrate
   commemoration
** commodity
   日用品
   merchandise 商品
   merchant 商人/商业的
** communal
   公共的/社区的 for public use
   community 社区
** advertent
   留意的
   inadvertent 不注意的
   advert v注意/广告
   advertise v做广告
   advertisement n广告
** compensate
   偿还/赔偿
   compensation n赔偿金
   compensatory n赔偿
