English/NewWords/TOEFL词根+联想.html

<div id="outline-container-4-11" class="outline-3">
<h3 id="sec-4-11"><span class="section-number-3">4.11</span> burgeon</h3>
<div class="outline-text-3" id="text-4-11">

<p>   bloom flourish 迅速增长<br/>
   发芽<br/>
</p></div>

</div>

<div id="outline-container-4-12" class="outline-3">
<h3 id="sec-4-12"><span class="section-number-3">4.12</span> cactus</h3>
<div class="outline-text-3" id="text-4-12">

<p>   仙人掌<br/>
</p></div>

</div>

<div id="outline-container-4-13" class="outline-3">
<h3 id="sec-4-13"><span class="section-number-3">4.13</span> calibration</h3>
<div class="outline-text-3" id="text-4-13">

<p>   calibrate 测量口径/调整<br/>
   calibration 标度/刻度<br/>
</p></div>

</div>

<div id="outline-container-4-14" class="outline-3">
<h3 id="sec-4-14"><span class="section-number-3">4.14</span> camouflage</h3>
<div class="outline-text-3" id="text-4-14">

<p>   disguise hide 掩饰/伪装<br/>
</p></div>

</div>

<div id="outline-container-4-15" class="outline-3">
<h3 id="sec-4-15"><span class="section-number-3">4.15</span> canvas</h3>
<div class="outline-text-3" id="text-4-15">

<p>   帆布/画布<br/>
</p></div>

</div>

<div id="outline-container-4-16" class="outline-3">
<h3 id="sec-4-16"><span class="section-number-3">4.16</span> canopy</h3>
<div class="outline-text-3" id="text-4-16">

<p>   遮篷<br/>
</p></div>

</div>

<div id="outline-container-4-17" class="outline-3">
<h3 id="sec-4-17"><span class="section-number-3">4.17</span> canyon</h3>
<div class="outline-text-3" id="text-4-17">

<p>   峡谷<br/>
</p></div>

</div>

<div id="outline-container-4-18" class="outline-3">
<h3 id="sec-4-18"><span class="section-number-3">4.18</span> capillary</h3>
<div class="outline-text-3" id="text-4-18">

<p>   毛细血管<br/>
   vessel 血管<br/>
</p></div>

</div>

<div id="outline-container-4-19" class="outline-3">
<h3 id="sec-4-19"><span class="section-number-3">4.19</span> cardiac</h3>
<div class="outline-text-3" id="text-4-19">

<p>   心脏的/心脏病的<br/>
   cardiac rhythm 心律<br/>
   cardiac failure 心力衰竭<br/>
</p></div>

</div>

<div id="outline-container-4-20" class="outline-3">
<h3 id="sec-4-20"><span class="section-number-3">4.20</span> cardinal</h3>
<div class="outline-text-3" id="text-4-20">

<p>   adj main essential 主要的/基本的<br/>
       vivid red 深红色的<br/>
   n 红衣主教<br/>
   cardinal number 基数<br/>
</p></div>

</div>

<div id="outline-container-4-21" class="outline-3">
<h3 id="sec-4-21"><span class="section-number-3">4.21</span> carnivore</h3>
<div class="outline-text-3" id="text-4-21">

<p>   食肉动物<br/>
   同义词：predator 捕食者/食肉动物<br/>
</p></div>

</div>

<div id="outline-container-4-22" class="outline-3">
<h3 id="sec-4-22"><span class="section-number-3">4.22</span> carp</h3>
<div class="outline-text-3" id="text-4-22">

<p>   鲤鱼<br/>
</p></div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> List5</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> cascara</h3>
<div class="outline-text-3" id="text-5-1">

<p>   缓泻剂（治疗便秘）<br/>
</p></div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> catalyst</h3>
<div class="outline-text-3" id="text-5-2">

<p>   [化学]催化剂<br/>
   刺激因素<br/>
</p></div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> caterpillar</h3>
<div class="outline-text-3" id="text-5-3">

<p>   毛虫（蝴蝶的幼虫）<br/>
</p></div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> cavity</h3>
<div class="outline-text-3" id="text-5-4">

<p>   cave 洞<br/>
   [解剖anatomy]腔<br/>
</p></div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> celestial</h3>
<div class="outline-text-3" id="text-5-5">

<p>   adj 天空的<br/>
   n 神仙<br/>
</p></div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> census</h3>
<div class="outline-text-3" id="text-5-6">

<p>   人口普查<br/>
</p></div>

</div>

<div id="outline-container-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> centennial</h3>
<div class="outline-text-3" id="text-5-7">

<p>   百年纪念<br/>
   centenary 百年的<br/>
   millennium 千年的/千禧年<br/>
</p></div>

</div>

<div id="outline-container-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> ceramic</h3>
<div class="outline-text-3" id="text-5-8">

<p>   陶瓷的<br/>
   ceram 陶瓷<br/>
</p></div>

</div>

<div id="outline-container-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> chafe</h3>
<div class="outline-text-3" id="text-5-9">

<p>   abrade rub 擦伤/摩擦<br/>
   激怒 irritate<br/>
</p></div>

</div>

<div id="outline-container-5-10" class="outline-3">
<h3 id="sec-5-10"><span class="section-number-3">5.10</span> chamber</h3>
<div class="outline-text-3" id="text-5-10">

<p>   n 房间/私人会所<br/>
   adj 私人的/室内的<br/>
</p></div>

</div>

<div id="outline-container-5-11" class="outline-3">
<h3 id="sec-5-11"><span class="section-number-3">5.11</span> chapel</h3>
<div class="outline-text-3" id="text-5-11">

<p>   小教堂<br/>
   cathedral 大教堂<br/>
   bazaar 集市<br/>
</p></div>

</div>

<div id="outline-container-5-12" class="outline-3">
<h3 id="sec-5-12"><span class="section-number-3">5.12</span> charter</h3>
<div class="outline-text-3" id="text-5-12">

<p>   n 宪章/执照<br/>
   v 特许<br/>
</p></div>

</div>

<div id="outline-container-5-13" class="outline-3">
<h3 id="sec-5-13"><span class="section-number-3">5.13</span> charcoal</h3>
<div class="outline-text-3" id="text-5-13">

<p>   木炭<br/>
</p></div>

</div>

<div id="outline-container-5-14" class="outline-3">
<h3 id="sec-5-14"><span class="section-number-3">5.14</span> checked</h3>
<div class="outline-text-3" id="text-5-14">

<p>   格子花纹的<br/>
</p></div>

</div>

<div id="outline-container-5-15" class="outline-3">
<h3 id="sec-5-15"><span class="section-number-3">5.15</span> baboon</h3>
<div class="outline-text-3" id="text-5-15">

<p>   狒狒<br/>
   chimpanzee 黑猩猩<br/>
   gorilla 大猩猩<br/>
   orangutan 猩猩<br/>
</p></div>

</div>

<div id="outline-container-5-16" class="outline-3">
<h3 id="sec-5-16"><span class="section-number-3">5.16</span> chlorine</h3>
<div class="outline-text-3" id="text-5-16">

<p>   [化学]氯<br/>
   aluminum 铝<br/>
   magnesium 镁<br/>
</p></div>

</div>

<div id="outline-container-5-17" class="outline-3">
<h3 id="sec-5-17"><span class="section-number-3">5.17</span> cholesterol</h3>
<div class="outline-text-3" id="text-5-17">

<p>   胆固醇<br/>
   chole 胆/胆汁<br/>
   sterol 固醇<br/>
</p></div>

</div>

<div id="outline-container-5-18" class="outline-3">
<h3 id="sec-5-18"><span class="section-number-3">5.18</span> choreograph</h3>
<div class="outline-text-3" id="text-5-18">

<p>   编排舞蹈<br/>
   choreographer 编舞者<br/>
   choreography 编舞/舞蹈艺术<br/>
</p></div>

</div>

<div id="outline-container-5-19" class="outline-3">
<h3 id="sec-5-19"><span class="section-number-3">5.19</span> choir</h3>
<div class="outline-text-3" id="text-5-19">

<p>   唱诗班<br/>
   chorus 合唱队<br/>
</p></div>

</div>

<div id="outline-container-5-20" class="outline-3">
<h3 id="sec-5-20"><span class="section-number-3">5.20</span> chronic</h3>
<div class="outline-text-3" id="text-5-20">

<p>   慢性的<br/>
   chronical 慢性的<br/>
   chron-时间相关的<br/>
   chronicle 编年史<br/>
   chrono-时间长的<br/>
   chronology 年代学<br/>
</p></div>

</div>

<div id="outline-container-5-21" class="outline-3">
<h3 id="sec-5-21"><span class="section-number-3">5.21</span> circumference</h3>
<div class="outline-text-3" id="text-5-21">

<p>   周长/圆周<br/>
   periphery 周边 peripheral equipment 外围设备<br/>
   perimeter 圆周<br/>
</p></div>

</div>

<div id="outline-container-5-22" class="outline-3">
<h3 id="sec-5-22"><span class="section-number-3">5.22</span> clam</h3>
<div class="outline-text-3" id="text-5-22">

<p>   蛤<br/>
   oyster 牡蛎<br/>
   abalone 鲍鱼<br/>
   coral 珊瑚<br/>
   crab 螃蟹<br/>
</p></div>

</div>

<div id="outline-container-5-23" class="outline-3">
<h3 id="sec-5-23"><span class="section-number-3">5.23</span> clamor</h3>
<div class="outline-text-3" id="text-5-23">

<p>   n/v 吵闹/喧嚷<br/>
   proclaim 声明/宣告<br/>
   proclamation<br/>
   reclaim 回收利用/开拓<br/>
   reclamation<br/>
   exclaim 感叹<br/>
   exclamation 感叹 exclamation mark感叹号 exclamatory 感叹的<br/>
   变名词时去掉i<br/>
</p></div>

</div>

<div id="outline-container-5-24" class="outline-3">
<h3 id="sec-5-24"><span class="section-number-3">5.24</span> clipper</h3>
<div class="outline-text-3" id="text-5-24">

<p>   快速帆船/大剪刀/理发剪刀<br/>
   clip n/v修剪<br/>
</p></div>

</div>

<div id="outline-container-5-25" class="outline-3">
<h3 id="sec-5-25"><span class="section-number-3">5.25</span> cluster</h3>
<div class="outline-text-3" id="text-5-25">

<p>   簇<br/>
</p></div>

</div>

<div id="outline-container-5-26" class="outline-3">
<h3 id="sec-5-26"><span class="section-number-3">5.26</span> clump</h3>
<div class="outline-text-3" id="text-5-26">

<p>   n 土块/丛<br/>
   v 形成丛<br/>
</p></div>

</div>

<div id="outline-container-5-27" class="outline-3">
<h3 id="sec-5-27"><span class="section-number-3">5.27</span> clutch</h3>
<div class="outline-text-3" id="text-5-27">

<p>   n 离合器<br/>
   v 抓住<br/>
</p></div>

</div>

<div id="outline-container-5-28" class="outline-3">
<h3 id="sec-5-28"><span class="section-number-3">5.28</span> coarse</h3>
<div class="outline-text-3" id="text-5-28">

<p>   粗糙的/粗俗的/下流的<br/>
   hoarse 嘶哑的<br/>
</p></div>

</div>

<div id="outline-container-5-29" class="outline-3">
<h3 id="sec-5-29"><span class="section-number-3">5.29</span> coax</h3>
<div class="outline-text-3" id="text-5-29">

<p>   哄/哄骗/慢慢弄好，细心处理<br/>
   Coax<br/>
   coaxial/coxal 同轴的（having a common axis）<br/>
</p></div>

</div>

<div id="outline-container-5-30" class="outline-3">
<h3 id="sec-5-30"><span class="section-number-3">5.30</span> cognition</h3>
<div class="outline-text-3" id="text-5-30">

<p>   认知/感知 perception<br/>
   cognitive 认知的<br/>
</p></div>

</div>

<div id="outline-container-5-31" class="outline-3">
<h3 id="sec-5-31"><span class="section-number-3">5.31</span> coil</h3>
<div class="outline-text-3" id="text-5-31">

<p>   n 卷/线圈<br/>
   v 盘绕<br/>
</p></div>

</div>

<div id="outline-container-5-32" class="outline-3">
<h3 id="sec-5-32"><span class="section-number-3">5.32</span> ellipsis</h3>
<div class="outline-text-3" id="text-5-32">

<p>   省略(号)<br/>
   ellipse 椭圆<br/>
</p></div>

</div>

<div id="outline-container-5-33" class="outline-3">
<h3 id="sec-5-33"><span class="section-number-3">5.33</span> apostrophe</h3>
<div class="outline-text-3" id="text-5-33">

<p>   省略号/撇号<br/>
</p></div>

</div>

<div id="outline-container-5-34" class="outline-3">
<h3 id="sec-5-34"><span class="section-number-3">5.34</span> despicable</h3>
<div class="outline-text-3" id="text-5-34">

<p>   卑鄙的<br/>
</p></div>

</div>

<div id="outline-container-5-35" class="outline-3">
<h3 id="sec-5-35"><span class="section-number-3">5.35</span> myriad</h3>
<div class="outline-text-3" id="text-5-35">

<p>   大量的<br/>
   一万<br/>
</p></div>

</div>

<div id="outline-container-5-36" class="outline-3">
<h3 id="sec-5-36"><span class="section-number-3">5.36</span> mnemonic</h3>
<div class="outline-text-3" id="text-5-36">

<p>   记忆的/助记的<br/>
</p>
<p>   <br/>
</p></div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> List6</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> collapse</h3>
<div class="outline-text-3" id="text-6-1">

<p>   倒塌/折叠（bootstrap中有一个控件叫collapse）<br/>
</p></div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> combustible</h3>
<div class="outline-text-3" id="text-6-2">

<p>   flammable 易燃的<br/>
   combust v燃烧<br/>
   combustion n<br/>
</p></div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> commemorate</h3>
<div class="outline-text-3" id="text-6-3">

<p>   v 纪念 honor/celebrate<br/>
   commemoration<br/>
</p></div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> commodity</h3>
<div class="outline-text-3" id="text-6-4">

<p>   日用品<br/>
   merchandise 商品<br/>
   merchant 商人/商业的<br/>
</p></div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> communal</h3>
<div class="outline-text-3" id="text-6-5">

<p>   公共的/社区的 for public use<br/>
   community 社区<br/>
</p></div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> advertent</h3>
<div class="outline-text-3" id="text-6-6">

<p>   留意的<br/>
   inadvertent 不注意的<br/>
   advert v注意/广告<br/>
   advertise v做广告<br/>
   advertisement n广告<br/>
</p></div>

</div>

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> compensate</h3>
<div class="outline-text-3" id="text-6-7">

<p>   偿还/赔偿<br/>
   compensation n赔偿金<br/>
   compensatory n赔偿<br/>
</p></div>

</div>
