English/NewWords/TOEFL词根+联想.org
** competence
   n 胜任/有能力
   compete 竞争
   competent capable有能力的
** comprise
   be composed of 由...构成
   #+begin_example
   The earth comprised three principal layers.
   #+end_example
** concede
   confess 承认
   yield 让步
** conceive
   设想/想象
   怀孕 become pregnant
   conceive of 想象
   #+begin_example
   It's hard to conceive of living on the moon.
   I can't conceive where he came up with that idea.
   #+end_example
** concert
   音乐会
   consistency/conherence 一致

   concerted 一致的/商定好的
** condensation
   压缩/凝聚/液化
   condense v浓缩
   condenser 冷凝器/聚光器
** confederacy
   联盟
   confederate n同盟国 a同盟的 united/federal
   confederative a同盟的/联邦的
** confer
   conference 会议
   conferee 与会者
   conferment n商议/颁给
   confer v商议
   授予/给予 award/give
   #+begin_example
   The invention will confer a benefit on all invalids(残疾人).
   #+end_example
* List7
** conform
   conform to
   comply with
   obey 遵守
   一致/符合
** malady
   疾病
** congenial
   意气相投的/相宜的/同性质的
   congeniality 同性质
   congener 同类的（人或物）
** kindred
   n家族，亲戚关系
   a同族的，血缘的，同类的
** consent
   v/n赞同，同意
   #+begin_example
   He threw me a smile that telegraphed consent.
   #+end_example
** constellation
   星座
** consort
   v 结交 make friends
   n 伙伴 partner, buddy, companion
** consonant
   辅音 consotantal 辅音的
   一致的，相符的
   consonance 和音chord/调和
   consonant with = in agreement with
   be consonant with
   #+begin_example
   behaving with a dignity consonant with his rank. 举止带有与其地位相符的气质
   #+end_example
** volatile
   易挥发的，不稳定的
** electorate
   选民
   elector 选民
   electoral a和选举相关的
** contagious
   传染的
   infectious 传染的
   contagion n传染（病）
   inflammation 发炎/炎症
   influenza 流行性感冒
   区别：contiguous 相邻的
** contaminate
   污染 pollute
   contamination 污染
   contaminator 污染者
   contaminated 污染的
   pollution 污染
   pollutent 污染物
** contour
   外形 shape/figure/appearance
   轮廓 outline
   Contour Integral 康托尔积分
** controversy
   n争论
   controversial a有争议的
   controvert v争论/议论/辩论
** convect
   空气对流
   the converting layer 对流层
   convection 对流
** converge
   收敛/聚合/汇聚 aggregate
   convergence 收敛（数学上）
** intervene
   interfere 干涉/介入
   intervention
   interference
** convict
   v定罪/判罪
   n囚犯 prisoner
   convicted 被判有罪的 proven/declared guilty
** cosmic
   宇宙的
   cosmos 宇宙
   celestial 天空的/天国的
   Celestial Empire 天朝
** correspond
   v符合/通信
   correspond to 和..符合/通信
   correspond with 符合/和...通信
   correspondent 通信者/记者reporter/journalist
   corresponding 一致的
** counteract
   抵消/消除/中和neutralize
** counterpart
   相似的人/物
** coupon
   优惠券/票据
* List8
** craft
   工艺/手艺/手工艺品
** crater
   火山口/陨石坑
** credential
   diploma/certificate/qualification 文凭/证书/资格
   diplomat 外交官
** crest
   （山）顶
** crisscross
   十字形/十字记号/矛盾
** critique
   criticism/comment 批评/评论
** cramped
   limited 狭窄的
   cramp v抽筋
** crude
   unrefined 天然的/未经提炼的
   refine 精炼/提纯
** crusade
   n 十字军/圣战
   v 从事改革运动
** crust
   面包皮/外壳
   #+begin_example
   the earth's crust 地壳
   #+end_example
** crustacean
   甲壳动物
** cue
   n clue 提示，线索
   v 提示
** cumbersome
   笨重的/麻烦的
   cumber v阻碍/防碍/阻塞
** cultivated
   耕种的/有修养的(educated/sophiscated)
** metabolic
   新陈代谢物
   metabolism n新陈代谢
   metabolize v新陈代谢
   metabolite n（生物）代谢物
** damp
   adj slightly wet 潮湿的
   n 潮湿
   v 打湿
