English/NewWords/TOEFL词根+联想.html

<div id="outline-container-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> competence</h3>
<div class="outline-text-3" id="text-6-8">

<p>   n 胜任/有能力<br/>
   compete 竞争<br/>
   competent capable有能力的<br/>
</p></div>

</div>

<div id="outline-container-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="section-number-3">6.9</span> comprise</h3>
<div class="outline-text-3" id="text-6-9">

<p>   be composed of 由&hellip;构成<br/>
</p>


<pre class="example">The earth comprised three principal layers.
</pre>

</div>

</div>

<div id="outline-container-6-10" class="outline-3">
<h3 id="sec-6-10"><span class="section-number-3">6.10</span> concede</h3>
<div class="outline-text-3" id="text-6-10">

<p>   confess 承认<br/>
   yield 让步<br/>
</p></div>

</div>

<div id="outline-container-6-11" class="outline-3">
<h3 id="sec-6-11"><span class="section-number-3">6.11</span> conceive</h3>
<div class="outline-text-3" id="text-6-11">

<p>   设想/想象<br/>
   怀孕 become pregnant<br/>
   conceive of 想象<br/>
</p>


<pre class="example">It's hard to conceive of living on the moon.
I can't conceive where he came up with that idea.
</pre>

</div>

</div>

<div id="outline-container-6-12" class="outline-3">
<h3 id="sec-6-12"><span class="section-number-3">6.12</span> concert</h3>
<div class="outline-text-3" id="text-6-12">

<p>   音乐会<br/>
   consistency/conherence 一致<br/>
</p>
<p>
   concerted 一致的/商定好的<br/>
</p></div>

</div>

<div id="outline-container-6-13" class="outline-3">
<h3 id="sec-6-13"><span class="section-number-3">6.13</span> condensation</h3>
<div class="outline-text-3" id="text-6-13">

<p>   压缩/凝聚/液化<br/>
   condense v浓缩<br/>
   condenser 冷凝器/聚光器<br/>
</p></div>

</div>

<div id="outline-container-6-14" class="outline-3">
<h3 id="sec-6-14"><span class="section-number-3">6.14</span> confederacy</h3>
<div class="outline-text-3" id="text-6-14">

<p>   联盟<br/>
   confederate n同盟国 a同盟的 united/federal<br/>
   confederative a同盟的/联邦的<br/>
</p></div>

</div>

<div id="outline-container-6-15" class="outline-3">
<h3 id="sec-6-15"><span class="section-number-3">6.15</span> confer</h3>
<div class="outline-text-3" id="text-6-15">

<p>   conference 会议<br/>
   conferee 与会者<br/>
   conferment n商议/颁给<br/>
   confer v商议<br/>
   授予/给予 award/give<br/>
</p>


<pre class="example">The invention will confer a benefit on all invalids(残疾人).
</pre>

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> List7</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> conform</h3>
<div class="outline-text-3" id="text-7-1">

<p>   conform to<br/>
   comply with<br/>
   obey 遵守<br/>
   一致/符合<br/>
</p></div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> malady</h3>
<div class="outline-text-3" id="text-7-2">

<p>   疾病<br/>
</p></div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> congenial</h3>
<div class="outline-text-3" id="text-7-3">

<p>   意气相投的/相宜的/同性质的<br/>
   congeniality 同性质<br/>
   congener 同类的（人或物）<br/>
</p></div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> kindred</h3>
<div class="outline-text-3" id="text-7-4">

<p>   n家族，亲戚关系<br/>
   a同族的，血缘的，同类的<br/>
</p></div>

</div>

<div id="outline-container-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> consent</h3>
<div class="outline-text-3" id="text-7-5">

<p>   v/n赞同，同意<br/>
</p>


<pre class="example">He threw me a smile that telegraphed consent.
</pre>

</div>

</div>

<div id="outline-container-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> constellation</h3>
<div class="outline-text-3" id="text-7-6">

<p>   星座<br/>
</p></div>

</div>

<div id="outline-container-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> consort</h3>
<div class="outline-text-3" id="text-7-7">

<p>   v 结交 make friends<br/>
   n 伙伴 partner, buddy, companion<br/>
</p></div>

</div>

<div id="outline-container-7-8" class="outline-3">
<h3 id="sec-7-8"><span class="section-number-3">7.8</span> consonant</h3>
<div class="outline-text-3" id="text-7-8">

<p>   辅音 consotantal 辅音的<br/>
   一致的，相符的<br/>
   consonance 和音chord/调和<br/>
   consonant with = in agreement with<br/>
   be consonant with<br/>
</p>


<pre class="example">behaving with a dignity consonant with his rank. 举止带有与其地位相符的气质
</pre>

</div>

</div>

<div id="outline-container-7-9" class="outline-3">
<h3 id="sec-7-9"><span class="section-number-3">7.9</span> volatile</h3>
<div class="outline-text-3" id="text-7-9">

<p>   易挥发的，不稳定的<br/>
</p></div>

</div>

<div id="outline-container-7-10" class="outline-3">
<h3 id="sec-7-10"><span class="section-number-3">7.10</span> electorate</h3>
<div class="outline-text-3" id="text-7-10">

<p>   选民<br/>
   elector 选民<br/>
   electoral a和选举相关的<br/>
</p></div>

</div>

<div id="outline-container-7-11" class="outline-3">
<h3 id="sec-7-11"><span class="section-number-3">7.11</span> contagious</h3>
<div class="outline-text-3" id="text-7-11">

<p>   传染的<br/>
   infectious 传染的<br/>
   contagion n传染（病）<br/>
   inflammation 发炎/炎症<br/>
   influenza 流行性感冒<br/>
   区别：contiguous 相邻的<br/>
</p></div>

</div>

<div id="outline-container-7-12" class="outline-3">
<h3 id="sec-7-12"><span class="section-number-3">7.12</span> contaminate</h3>
<div class="outline-text-3" id="text-7-12">

<p>   污染 pollute<br/>
   contamination 污染<br/>
   contaminator 污染者<br/>
   contaminated 污染的<br/>
   pollution 污染<br/>
   pollutent 污染物<br/>
</p></div>

</div>

<div id="outline-container-7-13" class="outline-3">
<h3 id="sec-7-13"><span class="section-number-3">7.13</span> contour</h3>
<div class="outline-text-3" id="text-7-13">

<p>   外形 shape/figure/appearance<br/>
   轮廓 outline<br/>
   Contour Integral 康托尔积分<br/>
</p></div>

</div>

<div id="outline-container-7-14" class="outline-3">
<h3 id="sec-7-14"><span class="section-number-3">7.14</span> controversy</h3>
<div class="outline-text-3" id="text-7-14">

<p>   n争论<br/>
   controversial a有争议的<br/>
   controvert v争论/议论/辩论<br/>
</p></div>

</div>

<div id="outline-container-7-15" class="outline-3">
<h3 id="sec-7-15"><span class="section-number-3">7.15</span> convect</h3>
<div class="outline-text-3" id="text-7-15">

<p>   空气对流<br/>
   the converting layer 对流层<br/>
   convection 对流<br/>
</p></div>

</div>

<div id="outline-container-7-16" class="outline-3">
<h3 id="sec-7-16"><span class="section-number-3">7.16</span> converge</h3>
<div class="outline-text-3" id="text-7-16">

<p>   收敛/聚合/汇聚 aggregate<br/>
   convergence 收敛（数学上）<br/>
</p></div>

</div>

<div id="outline-container-7-17" class="outline-3">
<h3 id="sec-7-17"><span class="section-number-3">7.17</span> intervene</h3>
<div class="outline-text-3" id="text-7-17">

<p>   interfere 干涉/介入<br/>
   intervention<br/>
   interference<br/>
</p></div>

</div>

<div id="outline-container-7-18" class="outline-3">
<h3 id="sec-7-18"><span class="section-number-3">7.18</span> convict</h3>
<div class="outline-text-3" id="text-7-18">

<p>   v定罪/判罪<br/>
   n囚犯 prisoner<br/>
   convicted 被判有罪的 proven/declared guilty<br/>
</p></div>

</div>

<div id="outline-container-7-19" class="outline-3">
<h3 id="sec-7-19"><span class="section-number-3">7.19</span> cosmic</h3>
<div class="outline-text-3" id="text-7-19">

<p>   宇宙的<br/>
   cosmos 宇宙<br/>
   celestial 天空的/天国的<br/>
   Celestial Empire 天朝<br/>
</p></div>

</div>

<div id="outline-container-7-20" class="outline-3">
<h3 id="sec-7-20"><span class="section-number-3">7.20</span> correspond</h3>
<div class="outline-text-3" id="text-7-20">

<p>   v符合/通信<br/>
   correspond to 和..符合/通信<br/>
   correspond with 符合/和&hellip;通信<br/>
   correspondent 通信者/记者reporter/journalist<br/>
   corresponding 一致的<br/>
</p></div>

</div>

<div id="outline-container-7-21" class="outline-3">
<h3 id="sec-7-21"><span class="section-number-3">7.21</span> counteract</h3>
<div class="outline-text-3" id="text-7-21">

<p>   抵消/消除/中和neutralize<br/>
</p></div>

</div>

<div id="outline-container-7-22" class="outline-3">
<h3 id="sec-7-22"><span class="section-number-3">7.22</span> counterpart</h3>
<div class="outline-text-3" id="text-7-22">

<p>   相似的人/物<br/>
</p></div>

</div>

<div id="outline-container-7-23" class="outline-3">
<h3 id="sec-7-23"><span class="section-number-3">7.23</span> coupon</h3>
<div class="outline-text-3" id="text-7-23">

<p>   优惠券/票据<br/>
</p></div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> List8</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> craft</h3>
<div class="outline-text-3" id="text-8-1">

<p>   工艺/手艺/手工艺品<br/>
</p></div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> crater</h3>
<div class="outline-text-3" id="text-8-2">

<p>   火山口/陨石坑<br/>
</p></div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> credential</h3>
<div class="outline-text-3" id="text-8-3">

<p>   diploma/certificate/qualification 文凭/证书/资格<br/>
   diplomat 外交官<br/>
</p></div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> crest</h3>
<div class="outline-text-3" id="text-8-4">

<p>   （山）顶<br/>
</p></div>

</div>

<div id="outline-container-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> crisscross</h3>
<div class="outline-text-3" id="text-8-5">

<p>   十字形/十字记号/矛盾<br/>
</p></div>

</div>

<div id="outline-container-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> critique</h3>
<div class="outline-text-3" id="text-8-6">

<p>   criticism/comment 批评/评论<br/>
</p></div>

</div>

<div id="outline-container-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="section-number-3">8.7</span> cramped</h3>
<div class="outline-text-3" id="text-8-7">

<p>   limited 狭窄的<br/>
   cramp v抽筋<br/>
</p></div>

</div>

<div id="outline-container-8-8" class="outline-3">
<h3 id="sec-8-8"><span class="section-number-3">8.8</span> crude</h3>
<div class="outline-text-3" id="text-8-8">

<p>   unrefined 天然的/未经提炼的<br/>
   refine 精炼/提纯<br/>
</p></div>

</div>

<div id="outline-container-8-9" class="outline-3">
<h3 id="sec-8-9"><span class="section-number-3">8.9</span> crusade</h3>
<div class="outline-text-3" id="text-8-9">

<p>   n 十字军/圣战<br/>
   v 从事改革运动<br/>
</p></div>

</div>

<div id="outline-container-8-10" class="outline-3">
<h3 id="sec-8-10"><span class="section-number-3">8.10</span> crust</h3>
<div class="outline-text-3" id="text-8-10">

<p>   面包皮/外壳<br/>
</p>


<pre class="example">the earth's crust 地壳
</pre>

</div>

</div>

<div id="outline-container-8-11" class="outline-3">
<h3 id="sec-8-11"><span class="section-number-3">8.11</span> crustacean</h3>
<div class="outline-text-3" id="text-8-11">

<p>   甲壳动物<br/>
</p></div>

</div>

<div id="outline-container-8-12" class="outline-3">
<h3 id="sec-8-12"><span class="section-number-3">8.12</span> cue</h3>
<div class="outline-text-3" id="text-8-12">

<p>   n clue 提示，线索<br/>
   v 提示<br/>
</p></div>

</div>

<div id="outline-container-8-13" class="outline-3">
<h3 id="sec-8-13"><span class="section-number-3">8.13</span> cumbersome</h3>
<div class="outline-text-3" id="text-8-13">

<p>   笨重的/麻烦的<br/>
   cumber v阻碍/防碍/阻塞<br/>
</p></div>

</div>

<div id="outline-container-8-14" class="outline-3">
<h3 id="sec-8-14"><span class="section-number-3">8.14</span> cultivated</h3>
<div class="outline-text-3" id="text-8-14">

<p>   耕种的/有修养的(educated/sophiscated)<br/>
</p></div>

</div>

<div id="outline-container-8-15" class="outline-3">
<h3 id="sec-8-15"><span class="section-number-3">8.15</span> metabolic</h3>
<div class="outline-text-3" id="text-8-15">

<p>   新陈代谢物<br/>
   metabolism n新陈代谢<br/>
   metabolize v新陈代谢<br/>
   metabolite n（生物）代谢物<br/>
</p></div>

</div>

<div id="outline-container-8-16" class="outline-3">
<h3 id="sec-8-16"><span class="section-number-3">8.16</span> damp</h3>
<div class="outline-text-3" id="text-8-16">

<p>   adj slightly wet 潮湿的<br/>
   n 潮湿<br/>
   v 打湿<br/>
</p></div>

</div>
