English/NewWords/TOEFL词根+联想.html

<div id="outline-container-8-17" class="outline-3">
<h3 id="sec-8-17"><span class="section-number-3">8.17</span> diminish</h3>
<div class="outline-text-3" id="text-8-17">

<p>   make/become less 减少<br/>
</p></div>

</div>

<div id="outline-container-8-18" class="outline-3">
<h3 id="sec-8-18"><span class="section-number-3">8.18</span> demolish</h3>
<div class="outline-text-3" id="text-8-18">

<p>   destroy 摧毁<br/>
   knock down a building 拆毁建筑<br/>
</p></div>

</div>

<div id="outline-container-8-19" class="outline-3">
<h3 id="sec-8-19"><span class="section-number-3">8.19</span> devour</h3>
<div class="outline-text-3" id="text-8-19">

<p>   eat food hungrily and quickly 狼吞虎咽地吃<br/>
   read quickly and eagerly 贪婪地读<br/>
</p></div>

</div>

<div id="outline-container-8-20" class="outline-3">
<h3 id="sec-8-20"><span class="section-number-3">8.20</span> dazzling</h3>
<div class="outline-text-3" id="text-8-20">

<p>   耀眼的/眼花缭乱的<br/>
</p>


<pre class="example">The sunlight is dazzling.
</pre>

<p>
   dazzle v晃眼<br/>
</p></div>

</div>

<div id="outline-container-8-21" class="outline-3">
<h3 id="sec-8-21"><span class="section-number-3">8.21</span> deteriorate</h3>
<div class="outline-text-3" id="text-8-21">

<p>   变质/变坏<br/>
</p>


<pre class="example">The relationship between the two countries had deteriorated sharply.
</pre>

<ol>
<li>erode 风化/侵蚀<br/>
      erosion<br/>
</li>
<li>rot 腐烂<br/>
</li>
<li>decay 腐坏/腐烂<br/>
</li>
<li>corrode 腐蚀/侵蚀<br/>
      corrosion<br/>
</li>
<li>mold n霉<br/>
      moldy 发霉的<br/>
</li>
</ol>

</div>

</div>

<div id="outline-container-8-22" class="outline-3">
<h3 id="sec-8-22"><span class="section-number-3">8.22</span> defect</h3>
<div class="outline-text-3" id="text-8-22">

<p>   a shortcoming/imperfection 缺点/缺乏<br/>
</p>


<pre class="example">generic defect
</pre>

</div>

</div>

<div id="outline-container-8-23" class="outline-3">
<h3 id="sec-8-23"><span class="section-number-3">8.23</span> delicate</h3>
<div class="outline-text-3" id="text-8-23">

<p>   fragile/subtle/exquisite 易碎的/微妙的/精巧的<br/>
</p></div>

</div>

<div id="outline-container-8-24" class="outline-3">
<h3 id="sec-8-24"><span class="section-number-3">8.24</span> deform</h3>
<div class="outline-text-3" id="text-8-24">

<p>   v变形<br/>
   deformed<br/>
   deformation<br/>
   misshape v损毁形状使成畸形<br/>
   misshapen adj变形的<br/>
</p></div>

</div>

<div id="outline-container-8-25" class="outline-3">
<h3 id="sec-8-25"><span class="section-number-3">8.25</span> deliberate</h3>
<div class="outline-text-3" id="text-8-25">

<p>   adj 故意的/谨慎的，深思熟虑的<br/>
   v 仔细考虑<br/>
   deliberately 故意地/谨慎地<br/>
</p></div>

</div>

<div id="outline-container-8-26" class="outline-3">
<h3 id="sec-8-26"><span class="section-number-3">8.26</span> denture</h3>
<div class="outline-text-3" id="text-8-26">

<p>   一副假牙<br/>
   dentist 牙医<br/>
   dentisty 牙科<br/>
</p></div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> List9</h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> deplete</h3>
<div class="outline-text-3" id="text-9-1">

<p>   diminish/reduce the number/qunatity of sth 减少<br/>
   exhaust 精疲力竭<br/>
   depletion n用尽/消耗完<br/>
</p></div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> deprive</h3>
<div class="outline-text-3" id="text-9-2">

<p>   剥夺某人对某物的使用/拥有权<br/>
   deprive sb/sth of sth<br/>
   sb/sth be deprived of sth<br/>
</p>


<pre class="example">Plant stems die when deprived of water.
</pre>

<p>
   deprivation<br/>
</p></div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> portray</h3>
<div class="outline-text-3" id="text-9-3">

<p>   depict/describe （文学作品/艺术中）描述/刻画；（电影/戏剧）扮演<br/>
   portray sb as sth 将某人描述成<br/>
</p></div>

</div>

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> designate</h3>
<div class="outline-text-3" id="text-9-4">

<p>   denominate 任命/指派<br/>
   name 命名<br/>
   designate sb as sth 任命某人为<br/>
</p></div>

</div>

<div id="outline-container-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> deter</h3>
<div class="outline-text-3" id="text-9-5">

<p>   discourage sb from doing sth 打消某人的念头/阻止做(因害怕后果而不敢去做)<br/>
</p></div>

</div>

<div id="outline-container-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> detest</h3>
<div class="outline-text-3" id="text-9-6">

<p>   hate<br/>
</p></div>

</div>

<div id="outline-container-9-7" class="outline-3">
<h3 id="sec-9-7"><span class="section-number-3">9.7</span> devise</h3>
<div class="outline-text-3" id="text-9-7">

<p>   v plan or invent by careful thought 策划/发明（经过精心思考）<br/>
   n 遗赠<br/>
</p></div>

</div>

<div id="outline-container-9-8" class="outline-3">
<h3 id="sec-9-8"><span class="section-number-3">9.8</span> devoid</h3>
<div class="outline-text-3" id="text-9-8">

<p>   v entirely lacking 完全缺乏<br/>
</p></div>

</div>

<div id="outline-container-9-9" class="outline-3">
<h3 id="sec-9-9"><span class="section-number-3">9.9</span> diagonal</h3>
<div class="outline-text-3" id="text-9-9">

<p>   n 对角线<br/>
   adj 对角线的/斜线的<br/>
</p></div>

</div>

<div id="outline-container-9-10" class="outline-3">
<h3 id="sec-9-10"><span class="section-number-3">9.10</span> diffuse</h3>
<div class="outline-text-3" id="text-9-10">

<p>   v spread/propogate 传播/渗入，弥漫<br/>
   adj 分散的/扩散的<br/>
</p></div>

</div>

<div id="outline-container-9-11" class="outline-3">
<h3 id="sec-9-11"><span class="section-number-3">9.11</span> dilute</h3>
<div class="outline-text-3" id="text-9-11">

<p>   v 稀释<br/>
</p>


<pre class="example">bleach can be diluted by cold water.
</pre>

<p>
   削弱力量/降低价值<br/>
</p>


<pre class="example">the reform has been diluted.
</pre>

<p>
   adj 稀释的/冲淡的<br/>
   dilutor 稀释剂<br/>
</p></div>

</div>

<div id="outline-container-9-12" class="outline-3">
<h3 id="sec-9-12"><span class="section-number-3">9.12</span> dim</h3>
<div class="outline-text-3" id="text-9-12">

<p>   adj 黯淡的/模糊的/昏暗的/悲观的<br/>
</p></div>

</div>

<div id="outline-container-9-13" class="outline-3">
<h3 id="sec-9-13"><span class="section-number-3">9.13</span> discern</h3>
<div class="outline-text-3" id="text-9-13">

<p>   v distinguish/perceive/recognize/discriminate 识别/辨别/察觉<br/>
</p>


<pre class="example">I can discern no difference between the two politics.
</pre>

<p>
   discernment 洞察力/识别<br/>
</p></div>

</div>

<div id="outline-container-9-14" class="outline-3">
<h3 id="sec-9-14"><span class="section-number-3">9.14</span> discharge</h3>
<div class="outline-text-3" id="text-9-14">

<ol>
<li>放电/漏电<br/>
</li>
<li>释放（液/气体）<br/>
</li>
</ol>

</div>

</div>

<div id="outline-container-9-15" class="outline-3">
<h3 id="sec-9-15"><span class="section-number-3">9.15</span> dilemma</h3>
<div class="outline-text-3" id="text-9-15">

<p>   n 进退两难的境地<br/>
   联想记忆：地雷嘛<br/>
</p></div>

</div>

<div id="outline-container-9-16" class="outline-3">
<h3 id="sec-9-16"><span class="section-number-3">9.16</span> deposit</h3>
<div class="outline-text-3" id="text-9-16">

<p>   v 沉积/存款/<br/>
   n 沉淀物/存款/保证金/押金<br/>
   deposition 沉积物<br/>
   depositor 存款人<br/>
   bank deposit 银行存款<br/>
   同义词：<br/>
   sediment n沉积物<br/>
   precipitate v使物质沉积/n[化学]沉淀物<br/>
</p>
<p>   <br/>
</p></div>
</div>
</div>
</div>

</body>
</html>
